Tekla Open API Reference for Tekla Structures 2025
Angle.TryParse Method (String, Angle)
 Parses the given text as an angle in the current unit type
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool TryParse(
	string text,
	out Angle result
)
Public Shared Function TryParse (
	text As String,
	<OutAttribute> ByRef result As Angle
) As Boolean
Parameters
text
Type: System.String
Text to parse
result
Type: Tekla.Structures.Datatype.Angle
Resulting angle if success
Return Value
Type: Boolean
True if the conversion succeeds, false otherwise
See Also
Reference
Angle Class
TryParse Overload
Tekla.Structures.Datatype Namespace